function getRandomNum( min, max )
{
	return Math.floor( Math.random() * max ) + min
}

lastNums = [-1, -1, -1]

const emoji = 
[
	// "🖤", "🥺",
	"😀", "😁", "😊", "😇", "😉", 
	"🥰", "🤪", "😎", "😳", "😍",
	"❤️", "🧡", "💛", "💚", "💙",
	"💜", "🤍", "💘", "💖", "✌️",
	"✨", "⭐️", "💫", "🌈", "☀️",
	"☘️", "🌿", "☁️", "🔥", "🌈",
	"🍻", "🥂", "✊"
]
//  😀😁😊😇😉😍🥰🤪😎🥺😳✌️❤️🧡💛💚💙💜🖤🤍🤎❤️‍🔥💘💖✨🌟⭐️💫🌈☀️☘️🌿☁️🔥🌈🍻🥂✊

const pleasantness =
[
	"UwU",
	"u so cute!~",
	"хорошего дня",
	"станешь моей печатной машинкой?",
	// "а ты давно так ослипительна?",
	// "мы успеем в забвение кануть в мире мемов, войны и спирта",
	"надеюсь дожить до пятницы",
	"пиво пиво пиво пиво",
	"ты заслуживаешь отдыха!~",
	"все будет хорошо!",
	"кто не спит, тот лох",
	"вижу милашкинс~",
	"давай лучше сходим в кино?",
	"присоединяйся к прокрастинации! не оставайся в стороне",
	"хороший человек и в беседе хорош))",
	"отдыхай и береги себя",
	"ПУПСИК, А ТЫ НЕ АХУЕЛ?",
	"сладких снов~",
	"доброе утро~",
	"ты солнышко!!",
	"mom.. mommy?",
	"ты замечательная булочка~",
	"милая очаровшка смотрит буковки",
	"кто пустил котенка к телефону?",
	"с днем пива!",
]

emojiElements = ["#e1", "#e2", "#e3"]

$(document).ready(function()
{
	$("#pleasantness").text( pleasantness[ getRandomNum(0, pleasantness.length) ] );
	
	for ( i = 0; i < emojiElements.length; i++ )
	{
		do
		{
			randNum = getRandomNum(0, emoji.length)
		} while ( lastNums.includes(randNum) )
		
		lastNums[i] = randNum

		$(emojiElements[i]).text( emoji[ randNum ] )
	}
});
